<template class="primary">
  <text-page :contents="contents" :title="title"></text-page>
</template>

<script>

import TextPage from "@/components/TextPage";
export default {
  name: 'Whats',
  components: {
    TextPage
  },
  data: () => ({
    title: {
      main: "What's \"じゃんけん\"",
      sub: "じゃんけんって？ルールは？"
    },
    contents: [
      {
        title: "じゃんけんとは",
        text: `-
じゃんけんは別名「邪威拳」と表記されアジア地域で良く使用される拳法の一つである。「愚・著・覇」の３つから成り立ち古来より物事の決定において話し合いで解決できないときに使用される拳法である。この「愚・著・覇」は各々の技の性質を国家の状態に例えたもので、愚は衆愚即ち愚かな大衆を指し、著は書物或いは知らしめること即ち知恵と法による統治、覇は覇道即ち武力と恐怖による統治を指す。即ち、知恵と法による統治が為されているうちは覇道は起こらないが、衆愚は知恵と法による統治を理解せず破壊し、その結果覇者が現れて衆愚は恐怖に屈する結果になるという、大衆の愚かさを大衆社会が興る遥か昔に指摘していたものであるとされる。
事実、この拳を実際に用いた際は愚で覇に負けようが相手を倒す事で威力を相手に示し物事を決定しようとする愚か者が度々現れ、その度に武力衝突となったと言われている。ここでも先述の「愚>著>覇」の関係を見てとることができる。
<br>
出典：民明書房刊「世界の決闘」(第2528版)
-
「ニコニコ大百科」<a href="https://dic.nicovideo.jp/a/%E3%82%B8%E3%83%A3%E3%83%B3%E3%82%B1%E3%83%B3" target="_blank">https://dic.nicovideo.jp/a/%E3%82%B8%E3%83%A3%E3%83%B3%E3%82%B1%E3%83%B3</a>
<br>`
      },
      {
        title: "クールさ基準でジャンケン対決",
        text: `-
ジャンケンについて「どうだろう、もうそろそろ飽きてる頃ではないだろうか」と切り出した記事が当サイトにある。
飽きてきたからどうするのかというと、ポージングのクールさで競うのだ。
何かすごいことを言いそうな出だしと、想像を遥か下を行くピュアな着地のギャップがたまらなく良い。楽しそうなのでやってみたが、これは参加者同士が作るムードが勝敗を左右する、高度なゲームであることが分かった。
-
「クールさ基準でジャンケン対決」<a href="https://dailyportalz.jp/kiji/cool-janken-2019" target="_blank">https://dailyportalz.jp/kiji/cool-janken-2019</a>
<br>`
      },
      {
        title: "真面目に　Wikipedia",
        text: `-
じゃんけん（漢字表記：石拳、両拳、雀拳）は、3種類の指の出し方（グー・チョキ・パー）で三すくみの関係を構成し、その出した種類により勝敗を決める遊戯。
日本国内では「じゃいけん」「いんじゃん」など地域によって様々な呼び方がある。中国では「猜拳」と呼ぶ。英語圏の場合、イギリスでは "Scissors Paper Stone" などと表現されることもあるが、イギリスやアメリカ合衆国を含めて多くは "Rock-paper-scissors" という呼称が使われている。
-
「じゃんけん」<a href="https://ja.wikipedia.org/wiki/%E3%81%98%E3%82%83%E3%82%93%E3%81%91%E3%82%93" target="_blank">https://ja.wikipedia.org/wiki/%E3%81%98%E3%82%83%E3%82%93%E3%81%91%E3%82%93</a>
<br>`
      },
    ]
  }),
  methods: {
    alert: (msg) => {
      alert(msg)
    },
  }
}
</script>
